cask_args appdir: "/Applications"

# Taps
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "kylef/formulae"
tap "thoughtbot/formulae"
tap "vapor/tap"

# Command line tools
brew "atlassian-cli"
brew "bash-completion"
brew "carthage"
brew "chisel"
brew "cloc"
brew "dart-lang/dart/dart"
brew "ffmpeg"
brew "ghostscript"
brew "git-lfs"
brew "git"
brew "gitup"
brew "go"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kylef/formulae/swiftenv"
brew "librsvg"
brew "lua"
brew "marathon-swift"
brew "markdown"
brew "mas"
brew "mitmproxy"
brew "node"
brew "pick"
brew "rbenv"
brew "sourcery"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "tmux"
brew "tree"
brew "vapor/tap/vapor"
brew "wget"
brew "youtube-dl"

# Applications
cask "airserver"
cask "alfred"
cask "android-studio"
cask "anybar"
cask "atom"
cask "awareness"
cask "bartender"
cask "charles"
cask "cocoarestclient"
cask "coconutbattery"
cask "controlplane"
cask "cyberduck"
cask "daisydisk"
cask "dash"
cask "docker-toolbox"
cask "docker"
cask "github-desktop"
cask "hammerspoon"
cask "handbrake"
cask "hazel"
cask "hipchat"
cask "hockey"
cask "imagealpha"
cask "imageoptim"
cask "iteleport-connect"
cask "iterm2"
cask "jadengeller-helium"
cask "java"
cask "jiggler"
cask "karabiner-elements"
cask "knuff"
cask "marked"
cask "nvalt"
cask "origami-studio"
cask "osxfuse"
cask "postman"
cask "provisionql"
cask "rocket"
cask "skype"
cask "smcfancontrol"
cask "sourcetree"
cask "spotify"
cask "teamviewer"
cask "tokens"
cask "virtualbox"
cask "vlc"
cask "wwdc"

# Mac App Store applications
mas "at.EternalStorms.Yoink", id: 457622435
mas "com.acqualia.soulver", id: 413965349
mas "com.apple.dt.Xcode", id: 497799835
mas "com.apple.garageband10", id: 682658836
mas "com.apple.iMovieApp", id: 408981434
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.aptonic.Dropzone3", id: 695406827
mas "com.blackpixel.kaleidoscope", id: 587512244
mas "com.hankinsoft.osx.sqliteprofessional", id: 586001240
mas "com.helloresolven.Rested", id: 421879749
mas "com.inovize.fluid", id: 1077036385
mas "com.junecloud.mac.Deliveries", id: 924726344
mas "com.krill.Patterns", id: 429449079
mas "com.most-advantageous.optimal-layout", id: 412627292
mas "com.nerdery.JSON-Accelerator", id: 511324989
mas "com.pilotmoon.popclip", id: 445189367
mas "com.pixelmatorteam.pixelmator", id: 407963104
mas "com.readitlater.PocketMac", id: 568494494
mas "com.realmacsoftware.clear.mac", id: 504544917
mas "com.rockysandstudio.Battery-Diag", id: 836505650
mas "com.rockysandstudio.Memory-Diag", id: 748212890
mas "com.SmartCodeHQ.EasyOnTheEyes", id: 799584781
mas "com.webinhq.ReadKit", id: 588726889
mas "com.wolfrosch.Gapplin", id: 768053424
mas "io.realm.realmbrowser", id: 1007457278
mas "it.bloop.airmail2", id: 918858936
mas "com.tinyspeck.slackmacgap", id: 803453959