cask_args appdir: "/Applications"

tap 'kylef/formulae'
tap 'thoughtbot/formulae'

# Command line tools
brew 'bash-completion'
brew 'carthage'
brew 'chisel'
brew 'cloc'
brew 'ghostscript'
brew 'git'
brew 'git-lfs'
brew 'gitup'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'lua'
brew 'markdown'
brew 'mas'
brew 'onepass'
brew 'pick'
brew 'rbenv'
brew 'swiftenv'
brew 'swiftformat'
brew 'swiftlint'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

# Applications
cask 'airserver'
cask 'anybar'
cask 'atom'
cask 'awareness'
cask 'bartender'
cask 'cocoarestclient'
cask 'coconutbattery'
cask 'controlplane'
cask 'cyberduck'
cask 'docker'
cask 'docker-toolbox'
cask 'fabric'
cask 'github-desktop'
cask 'hammerspoon'
cask 'handbrake'
cask 'hazel'
cask 'helium'
cask 'imagealpha'
cask 'imageoptim'
cask 'inkscape'
cask 'iteleport-connect'
cask 'jiggler'
cask 'knuff'
cask 'ksdiff'
cask 'marked'
cask 'nvalt'
cask 'origami'
cask 'osxfuse'
cask 'rocket'
cask 'skype'
cask 'smcfancontrol'
cask 'sourcetree'
cask 'spotify'
cask 'teamviewer'
cask 'tokens'
cask 'virtualbox'
cask 'vlc'
cask 'wwdc'