cask_args appdir: "/Applications"

brew "carthage"
brew "chisel"
brew "cloc"
brew "ffmpeg"
brew "git-lfs"
brew "go"
brew "imagemagick"
brew "jq"
brew "mitmproxy"
brew "sourcery"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "vapor/tap/vapor"

cask "android-studio"
cask "charles"
cask "docker-toolbox"
cask "docker"
cask "imagealpha"
cask "imageoptim"
cask "postman"
