cask_args appdir: "/Applications"

mas "at.EternalStorms.Yoink", id: 457622435
mas "com.acqualia.soulver", id: 413965349
mas "com.apple.dt.Xcode", id: 497799835
mas "com.apple.garageband10", id: 682658836
mas "com.apple.iMovieApp", id: 408981434
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.aptonic.Dropzone3", id: 695406827
mas "com.blackpixel.kaleidoscope", id: 587512244
mas "com.hankinsoft.osx.sqliteprofessional", id: 586001240
mas "com.inovize.fluid", id: 1077036385
mas "com.junecloud.mac.Deliveries", id: 924726344
mas "com.krill.Patterns", id: 429449079
mas "com.most-advantageous.optimal-layout", id: 412627292
mas "com.nerdery.JSON-Accelerator", id: 511324989
mas "com.pilotmoon.popclip", id: 445189367
mas "com.pixelmatorteam.pixelmator", id: 407963104
mas "com.readitlater.PocketMac", id: 568494494
mas "com.realmacsoftware.clear.mac", id: 504544917
mas "com.rockysandstudio.Battery-Diag", id: 836505650
mas "com.rockysandstudio.Memory-Diag", id: 748212890
mas "com.SmartCodeHQ.EasyOnTheEyes", id: 799584781
mas "com.webinhq.ReadKit", id: 588726889
mas "com.wolfrosch.Gapplin", id: 768053424
mas "io.realm.realmbrowser", id: 1007457278
mas "it.bloop.airmail2", id: 918858936
mas "com.tinyspeck.slackmacgap", id: 803453959
